WebContent/WEB-INF/classes/LiveIdLogin.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wssc="http://schemas.xmlsoap.org/ws/2005/02/sc"
	xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust">
	<s:Header>
		<wlid:ClientInfo xmlns:wlid="http://schemas.microsoft.com/wlid">
			<wlid:ApplicationID>10</wlid:ApplicationID>
		</wlid:ClientInfo>
		<wsa:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/02/trust/RST/Issue
		</wsa:Action>
		<wsa:To s:mustUnderstand="1">https://dev.login.live.com/wstlogin.srf
		</wsa:To>
		<wsse:Security>
			<wsse:UsernameToken wsu:Id="user">
				<wsse:Username><![CDATA[%USERNAME%]]></wsse:Username>
				<wsse:Password><![CDATA[%PASSWORD%]]></wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</s:Header>
	<s:Body>
		<wst:RequestSecurityToken Id="RST1">
			<wst:RequestType>http://schemas.xmlsoap.org/ws/2005/02/trust/Issue
			</wst:RequestType>
			<wsp:AppliesTo>
				<wsa:EndpointReference>
					<wsa:Address><![CDATA[%SERVER%]]></wsa:Address>
				</wsa:EndpointReference>
			</wsp:AppliesTo>
			<wsp:PolicyReference URI="%POLICY%" />
		</wst:RequestSecurityToken>
	</s:Body>
</s:Envelope>
